while True:
    print(f'Введите число от 3 до 20')
    divider = int(input())
    number_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
    number_2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
    need_key = []
    finish_key = str()
    for i in number_1:
        for j in number_2:
            if divider % (i + j) == 0 and i < j:
                need_key.append(i)
                need_key.append(j)
    for k in need_key:
        finish_key += str(k)
    print(finish_key)


    #Дальше проверка
    check = [12, 13, 1423, 121524, 162534, 13172635, 1218273645, 141923283746, 11029384756, 12131511124210394857,
             112211310495867, 1611325212343114105968, 1214114232133124115106978, 1317115262143531341251161079,
             11621531441351261171089, 12151811724272163631545414513612711810, 118217316415514613712811910,
             13141911923282183731746416515614713812911]
    if int(finish_key) == check[divider - 3]:
        print(True)
    else:
        print(False)
